Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX320F032H.atdf
      <value-group caption="CVref Range Selection bit" name="CVRCON__CVRR">
         <value caption="0 to 0.67 CVrsrc with CVrsrc/24 step size" name="" value="0x1" />
         <value caption="0.25 CVrsrc to 0.75 CVrsrc with CVrsrc/32 step size" name="" value="0x0" />
      </value-group>
      <value-group caption="CVrefout Enable bit" name="CVRCON__CVROE">
         <value caption="Voltage level is output on CVrefout pin" name="" value="0x1" />
         <value caption="Voltage level is disconnected from CVrefout pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Voltage Reference On bit" name="CVRCON__ON">
         <value caption="Module is enabled. Setting this bit does not affect other bits in the register." name="" value="0x1" />
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in the register." name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00788" name="DDPSTAT" version="1">
      <register-group name="DDPSTAT">
         <register caption="" name="_DDPSTAT" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000002" name="APIFUL" />
            <bitfield mask="0x00000004" name="APOFUL" />
            <bitfield mask="0x00000008" name="STRFUL" />
            <bitfield mask="0x00000200" name="APIOV" />
            <bitfield mask="0x00000400" name="APOOV" />
            <bitfield mask="0xFFFF0000" name="STOV" />
         </register>
         <register caption="George" name="_STRO" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="_STRO" />
         </register>
         <register caption="George" name="_APPO" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="_APPO" />
         </register>
         <register caption="George" name="_APPI" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="_APPI" />
         </register>
      </register-group>
   </module>
   <module caption="" id="00774" name="I2C" version="1">
      <register-group name="I2C">
         <register caption="I2C Control Register" name="I2C1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C1CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C1CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C1CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C1CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C1CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C1CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C1CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C1CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C1CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C1CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C1CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C1CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C1CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C1CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C1CON__ON" />
         </register>
         <register caption="I2C Control Register" name="I2C2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C2CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C2CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C2CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C2CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C2CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C2CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C2CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C2CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C2CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C2CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C2CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C2CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C2CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C2CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C2CON__ON" />
         </register>
